clear;clc;

% 本例是优化模型2 PPT第48页 选址与供应问题第二问(57页)

x0 = [3 5 0 7 0 1 0 0 4 0 6 10 5 1 2 7]'; % 初值取上一问计算结果
A = [1 1 1 1 1 1 0 0 0 0 0 0 0 0 0 0;0 0 0 0 0 0 1 1 1 1 1 1 0 0 0 0 ];
B = [20;20]; % AX<=B
A1 = [1 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0; 0 1 0 0 0 0 0 1 0 0 0 0 0 0 0 0;0 0 1 0 0 0 0 0 1 0 0 0 0 0 0 0; 0 0 0 1 0 0 0 0 0 1 0 0 0 0 0 0;0 0 0 0 1 0 0 0 0 0 1 0 0 0 0 0; 0 0 0 0 0 1 0 0 0 0 0 1 0 0 0 0];
b1 = [3 5 4 7 6 11]'; % A1X=b1
LB = [zeros(12,1);-inf;-inf;-inf;-inf]; % 参数下界
UB = []; % 参数上界
[x,fval,exitflag] = fmincon('afun1',x0,A,B,A1,b1,LB,UB);
x,fval,exitflag