clear;clc;

% 本例是优化模型2 PPT第48页 选址与供应问题第一问

a=[1.25 8.75 0.5 5.75 3 7.25]; % 6个工地的横坐标
b=[1.25 0.75 4.75 5 6.5 7.75]; % 6个工地的纵坐标
d=[3 5 4 7 6 11]; % 6个工地的每日用料
x=[5 2]; % 料场1的位置
y=[1 7]; % 料场2的位置
e=[20 20]; % 两个料场的日储量
for i=1:6
    for j=1:2
        aa(i,j)=sqrt((x(j)-a(i))^2+(y(j)-b(i))^2); % 计算每个Xij的系数项
    end
end
CC=[aa(:,1);aa(:,2)]'; % 将这两列的系数项排成一行,那么要求的X也被排成一行
A=[1 1 1 1 1 1 0 0 0 0 0 0;0 0 0 0 0 0 1 1 1 1 1 1 ]; % AX<=B
B=e'; % AX<=B,这里把B变成两行
% 接下来两行是A1X=b1的约束,这里是i一样的Xi0+Xi1,也就是隔开6个位置
A1 = [1 0 0 0 0 0 1 0 0 0 0 0; 0 1 0 0 0 0 0 1 0 0 0 0;0 0 1 0 0 0 0 0 1 0 0 0;0 0 0 1 0 0 0 0 0 1 0 0;0 0 0 0 1 0 0 0 0 0 1 0;0 0 0 0 0 1 0 0 0 0 0 1];
b1 = d'; % A1X=b1,这里配成6列的
LB = zeros(1,12);UB=[]; % 最小最大值,这里是要求运输量不能为负
x0 = [1 2 3 0 1 0 0 1 0 1 0 1]; % Xij平铺后的初始值
[x,fval] = linprog(CC,A,B,A1,b1,LB,UB,x0); % 线性规划
x,fval